Repository: Seekladoom/NyuFX
Catalog: lang/*/nyufx.po
Languages: ar, de, fr

source: Lua editor
ar: محرر سكربت لوا
fr: Éditeur Lua

source: Choose sound file
ar: اختار الملف
de: Wähle Audiodatei
fr: Choisir un fichier audio

source: Select all text in focus
ar: تحديد جميع النص
de: Wähle gesamten Editortext aus
fr: Sélectionner tout le texte dans la cible

source: Help
ar: مساعدة
de: Hilfe
fr: Aide

source: Open file for focused editor
ar: فتح الملف لمركز المحرر
de: Öffne Datei für fokussierten Editor
fr: Ouvrir le fichier pour l'éditeur ciblé

source: Set progressbar to 0%
ar: إعادة شريط التقدم إلى الصفر
de: Setze Fortschrittsbalken auf 0%
fr: Barre de progression à 0%

source: Thanks to:
ar: الشكر الجزيل لـ
de: Dank an:
fr: Merci à :

source: Zooms one level nearer to editor content
ar: تقريب إلى أقرب نقطة في المحرر
de: Verkleinere Sichtfeld zum Editorinhalt um eine Stufe
fr: Zooms un niveau plus proches du contenu de l'éditeur

source: Open
ar: افتح
de: Öffnen
fr: Ouvrir

source: Unfolds all lines in Lua editor
ar: كشف جميع الاسطر في محرر اللوا
de: Entfalte alle Zeilen im Lua Editor
fr: Déplier toutes les lignes dans l'éditeur Lua

source: Paste
ar: لصق
de: Einfügen
fr: Coller

source: Open Lua file
ar: افتح سكربت لوا
de: Öffne Lua Datei
fr: Ouvrir un fichier Lua

source: HTML & PDF documents in 'docs' folder
ar: ملفات الهوتمل
de: HTML & PDF Dokumente im 'docs' Ordner
fr: HTML & documents PDF dans le dossier 'docs'

source: Copy
ar: نسخ
de: Kopieren
fr: Copier

source: Search and replace text
ar: البحث واستبدال النص
de: Suchen und Ersetzen
fr: Rechercher et remplacer du texte

source: Copy selection to clipboard
ar: نسخ المحدد إلى الحافظة
de: Kopiere Auswahl zur Zwischenablage
fr: Copier la sélection dans le presse-papiers

source: Taskicon?
ar: أيقونة المهمة
de: Tasksymbol?
fr: Icône de tâche ?

source: Options
ar: خيارات
de: Optionen

source: Generate
ar: توليد
de: Generieren
fr: Générer

source: Reload
ar: تحميل
de: Neu laden
fr: Recharger

source: Font
ar: خط
de: Schrift
fr: Police

source: Application options
ar: خيارات التطبيق
de: Anwendungsoptionen
fr: Options de l'application

source: View
ar: مشاهدة
de: Ansicht
fr: Affichage

source: Paste clipboard
ar: لصق الحافظة
de: Füge Zwischenablage ein
fr: Coller depuis le presse-papiers

source: Reload opened file for focused editor
ar: إعادة تحميل الملف المفتوح للمحرر
de: Lade geöffnete Datei des fokussierten Editors neu
fr: Recharger le fichier ouvert pour l'éditeur ciblé

source: Choose
ar: اختار
de: Wähle
fr: Choisir

source: Zooms one level farther to editor content
ar: تكبير إلى أبعد مستوى لمحتوى المحرر
de: Vergrößere Sichtfeld zum Editorinhalt um eine Stufe
fr: Zooms un niveau plus loin du contenu de l'éditeur

source: Open include folder
ar: فتح الملف المتضمن
de: Öffne include Ordner
fr: Ouvrir le dossier 'include'

source: Process error
ar: خطأ في العملية
de: Prozessfehler
fr: Erreur de processus

source: Replace
ar: استبدال
de: Ersetzen
fr: Remplacer

source: Website:
ar: موقع الكتروني
de: Internetpräsenz:
fr: Site Web :

source: Delete
ar: حذف
de: Löschen
fr: Supprimer

source: Help browser
ar: المساعدة
de: Hilfsbrowser
fr: Navigateur d'aide

source: Auto-Style
ar: النمط العادي

source: Show/Hide
ar: إخفاء/إظهار
de: Zeigen/Verstecken
fr: Afficher/Masquer

source: Forward in history
ar: إلى أمام التاريخ
de: Vorwärts im Verlauf
fr: Avancer dans l'historique

source: NONE
ar: لا شيء!
de: NICHTS

source: Close
ar: أغلق
de: Schließen
fr: Fermer

source: Save
ar: حفظ
de: Speichern
fr: Enregistrer

source: Go to line...
ar: إذهب إلى السطر...
de: Springe zu Zeile...
fr: Aller à la ligne...

source: Stop page loading
ar: إيقاف تحميل الصفحة
de: Stoppe Laden der Seite
fr: Arrêter le chargement de la page

source: File not exists!
ar: !الملف غير موجود
de: Datei existiert nicht!
fr: Le fichier n'existe pas !

source: Zoom out
ar: تصغير
de: Vergrößere Sichtfeld
fr: Zoom arrière

source: Current URL
ar: مسار الـ URL
de: Momentane URL
fr: URL actuelle

source: Output options
ar: خيارات الإخراج
de: Ausgabeoptionen
fr: Options de sortie

source: Cut selection to clipboard
ar: قص المحدد إلى الحافظة
de: Schneide Auswahl aus zur Zwischenablage
fr: Couper la sélection dans le presse-papiers

source: Reset
ar: إعادة الأمور لسابقتها
de: Zurücksetzen
fr: Réinitialiser

source: ASS editor
ar: محرر ملف التوقيت
fr: Éditeur ASS

source: Clear log text
ar: مسح السجل
de: Leere Protokoll
fr: Effacer le texte du journal

source: Abort
ar: إحباط
de: Abbrechen
fr: Interrompre

source: Toggle view for ASS editor
ar: تبديل العرض لمحرر سكربت التوقيت
de: Schalte ASS Editorsichtbarkeit um
fr: Basculer la vue pour l'éditeur ASS

source: Quit
ar: خروج
de: Verlassen
fr: Quitter

source: Editor view
ar: مشاهدة المحرر
de: Editor Ansicht
fr: Vue de l'éditeur

source: Tools
ar: أداوت
de: Werkzeuge
fr: Outils

source: Lua error
ar: خطأ بالسكربت
de: Lua Fehler
fr: Erreur Lua

source: Clear file of focused editor
ar: تنظيف مركز المحرر
de: Leere Datei im fokussierten Editor
fr: Effacer le fichier de l'éditeur ciblé

source: Start process!
ar: ابدأ بالعملية
de: Starte Prozess!
fr: Démarrer le processus !

source: Choose line number
ar: اختر رقم السطر
de: Wähle Zeile
fr: Choisir le numéro de la ligne

source: Moves caret to line
ar: تحريك العلامة إلى السطر
de: Bewege Textmarke zu Zeile
fr: Déplacer le curseur à la ligne

source: Go to Lua line...
ar: إذهب إلى سطر ملف اللوا..
de: Springe zu Lua Zeile...
fr: Aller à la ligne Lua...

source: Undo
ar: تراجع
de: Rückgängig machen
fr: Annuler

source: Log
ar: سجل
de: Protokoll
fr: Historique d'événements

source: Help for how to use the tool
ar: مساعدة بكيفية استخدام الاداة

source: AFTER PROGRESS
ar: بعد العملية

source: Minimize program to taskicon? (otherwise to taskbar)
ar: تصغير البرنامج الى شريط مالهام
de: Minimiere Programm zu Tasksymbol? (andernfalls zu Taskleiste)
fr: Minimiser le programme en icône de tâche ? (Autrement dans la barre des tâches)

source: Load page
ar: تحميل الصفحة
de: Lade Seite
fr: Charger la page

source: Do you really want to abort process?
ar: هل تريد حقًا إلغاء العملية؟
de: Möchten sie wirklich den Prozess abbrechen?
fr: Voulez-vous vraiment interrompre le processus ?

source: Open folders of NyuFX
ar: فتح ملفات الاداة
de: Öffne Ordner von NyuFX
fr: Ouvrir les dossiers de NyuFX

source: Back in history
ar: الرجوع إلى الوراء
de: Zurück im Verlauf
fr: Retour dans l'historique

source: File saved?
ar: الملف المحفوظ؟
de: Datei gespeichert?
fr: Fichier enregistré ?

source: Currently terminating process!
ar: إنها العلملية حاليا
de: Derzeit wird der Prozess beendet!
fr: Termine actuellement le processus !

source: Toggle view for Lua editor
ar: تبديل العرض لمحرر سكربت اللوا
de: Schalte Sicht des Lua Editors um
fr: Basculer la vue pour l'éditeur Lua

source: Edit
ar: تعديل
de: Bearbeiten
fr: Édition

source: Search and replace - Lua editor
ar: بحث واستبدال في محرر سكربت لوا
de: Suchen und Ersetzen - Lua Editor
fr: Rechercher et remplacer - Éditeur Lua

source: Search and replace - ASS editor
ar: بحث واستبدال في محرر سكربت التوقيت
de: Suchen und Ersetzen - ASS Editor
fr: Rechercher et remplacer - Éditeur ASS

source: 'Exit' function is missing!
ar: وظيفة الاخراج مفقود
de: 'Exit' Funktion fehlt!
fr: 'Exit' fonction est manquante !

source: Open ASS file
ar: فتح ملف التوقيت
de: Öffne ASS Datei
fr: Ouvrir un fichier ASS

source: Programmer:
ar: المبرمج:
de: Programmierer:
fr: Programmeur :

source: Delete selection
ar: حذف المحدد
de: Lösche Auswahl
fr: Supprimer la sélection

source: Choose output file
ar: مكان حفظ الملف
de: Wähle Ausgabedatei
fr: Choisir le fichier de sortie

source: Redo action
ar: إعادة العملية
de: Wiederhole Aktion
fr: Rétablir l'action

source: Couldn't run thread!
ar: لا يمكن التشغيل
de: Konnte Thread nicht laufen lassen!
fr: Impossible de démarrer le fil d'instruction !

source: Go to ASS line...
ar: إذهب إلى السطر لملف التوقيت...
de: Springe zu ASS Zeile...
fr: Aller à la ligne ASS...

source: Output by 'print' function
ar: ملف الاخراج بواسطة دالة الطباعة
de: Ausgabe durch 'print' Funktion
fr: Sortie par la fonction 'print'

source: Folds all lines in Lua editor
ar: طي جميع الاسطر في محرر السكربت
de: Falte alle Zeilen im Lua Editor
fr: Replier toutes les lignes dans l'éditeur Lua

source: New
ar: جديد
de: Neu
fr: Nouveau

source: Open tools folder
ar: فتح ملف الادوات
de: Öffne tools Ordner
fr: Ouvrir le dossier 'tools'

source: Language change requires a program restart
ar: تغيير اللغة يتطلب إعادة التشغيل
de: Sprachänderung erfordert einen Programm Neustart
fr: Le changement de langue nécessite un redémarrage du programme

source: Save ASS file
ar: حفظ ملف التوقيت
de: Speichere ASS Datei
fr: Enregistrer le fichier ASS

source: GUI language
ar: لغة واجهة الأداة
de: GUI Sprache
fr: GUI langage

source: Style text
ar: نمط النص
de: Gestalte text
fr: Style de texte

source: About
ar: بخصوص
de: Info
fr: À propos

source: 'Init' function is missing!
ar: الدالة مفقودة
de: 'Init' Funktion fehlt!
fr: 'Init' fonction est manquante !

source: Karaoke effect creation with pixel & vector utilities.
ar: إنشاء تأثير الكاراوكي مع خاصية البكسل و خواص أخرى
de: Karaoke Effekt Erstellung mit Pixel & Vektor Werkzeugen.
fr: Création d'effet karaoké avec pixel & utilitaires vecteur.

source: Informations about NyuFX
ar: معلومات عن الأداة
de: Informationen über NyuFX
fr: Informations sur NyuFX

source: Save file of focused editor
ar: حفظ الملف من المحرر
de: Speichere Datei des fokussierten Editors
fr: Enregistrer le fichier de l'éditeur de ciblé

source: Folders
ar: الملفات
de: Ordner
fr: Dossiers

source: Unfold all
ar: كسف الكل
de: Entfalte alles
fr: Deplier tout

source: Active editor
ar: المحرر النشط
de: Aktiver Editor
fr: Éditeur actif

source: Save Lua file
ar: حفظ ملف اللوا
de: Speichere Lua Datei
fr: Enregistrer le fichier Lua

source: Progress
ar: عملية التطبيق
de: Prozess
fr: Progression

source: Output file error
ar: خطأ بالملف المخرج
de: Ausgabedatei Fehler
fr: Erreur du fichier de sortie

source: Open output file
ar: فتح ملف الإخراج
de: Öffne Ausgabedatei
fr: Ouvrir le fichier de sortie

source: Cut
ar: قطع
de: Ausschneiden
fr: Couper

source: Cancel
ar: إلغاء
de: Abbrechen
fr: Annuler

source: Default font of both editors
ar: الخط الأفتراضي لكلا المحرران
de: Standard Schrift von beiden Editoren
fr: Police par défaut dans les deux éditeurs

source: Open templates folder
ar: فتح ملف القوالب
de: Öffne templates Ordner
fr: Ouvrir le dossier 'templates'

source: Couldn't create thread!
ar: تعذر إنشاء الصفحة!
de: Konnte Thread nicht erstellen!
fr: Impossible de créer le fil d'instruction !

source: Save file with specific target of focused editor
ar: حفظ الملف مع مركز محدد
de: Speichere Datei mit ausgewähltem Ziel vom fokussierten Editor
fr: Enregistrer le fichier avec le chemin spécifique de l'éditeur ciblé

source: Undo action
ar: التراجع عن الإجراء
de: Mache Aktion rückgängig
fr: Annuler l'action

source: Access error
ar: منفذ خاطئ
de: Zugriffsfehler
fr: Erreur d'accès

source: Choose an output file
ar: اخيار مكان حفظ الملف
de: Wähle Ausgabedatei
fr: Choisir un fichier de sortie

source: Output
ar: الإخراج
de: Ausgabe
fr: Sortie

source: Zoom in
ar: تكبير
de: Verkleinere Sichtfeld
fr: Zoom avant

source: Fold all
ar: طي الكل
de: Falte alles
fr: Replier tout

source: Accept
ar: الموافقة
de: Akzeptieren
fr: Accepter

source: Set by 'io.progressbar' function
ar: وضعية دالة شريط التقدم
de: Gesetzt bei Funktion 'io.progressbar'
fr: Définie par la fonction 'io.progressbar'

source: Not possible while a process is running!
ar: لا يمكن حاليا فالعملية قيد التشغيل
de: Nicht möglich während laufendem Prozess!
fr: Impossible tant qu'un processus est en marche !

source: Sound file to play after generation
ar: لتشغيل ملف
de: Audiodatei zum Abspielen nach der Generierung
fr: Fichier audio à jouer après génération

source: Select all
ar: تحديد الكل
de: Alles auswählen
fr: Sélectionner tout

source: Redo
ar: إعادة
de: Wiederherstellen
fr: Rétablir

source: Save as...
ar: حفظ الملف كـ..
de: Speichern als...
fr: Enregistrer sous...

source: Sound
ar: الصوت
de: Audio
fr: Audio

source: Language
ar: اختيار اللغة
de: Sprache
fr: Langage

source: Stop process!
ar: إيقاف العملية!
de: Stoppe Prozess!
fr: Arrêter le processus !

source: Close NyuFX
ar: إغلاق الأداة
de: Schließe NyuFX
fr: Fermer NyuFX

source: File
ar: ملف
de: Datei
fr: Fichier

source: Progressbar
ar: شريط التقدم
de: Fortschrittsbalken
fr: Barre de progression

source: Toggle editors visibility
de: Schalte Editorsichtbarkeit um
fr: Basculer la visibilité des éditeurs

source: Help for NyuFX usage
de: NyuFX Nutzungshilfe
fr: Aide pour l'utilisation de NyuFX

source: After process command
de: Kommando nach Prozess
fr: Après exécution de la commande
